CCNP ENARSI	
Curso: Path control y redistribución de rutas
Laboratorio: Redistribución de ruta IPv4
Firmware: Routers  -> c7200-advipservicesk9-mz.152-4.S5.bin 
      
	  
Escenario: Openwebinars tiene implementado EIGRP y requiere brindar conexión con un nuevo proveedor que emplea OSPF 

Completa los siguientes puntos para configurar redistribución de ruta entre Openwebinars y el nuevo proveedor


1. Cómo se conocen en R2 las redes LAN de R1 (10.1.1.0/24 y 10.1.2.0/24) y R3 (172.16.1.0/24 y 172.16.2.0/24), existe conectividad desde R2 hacía las IP's de R1 y R3 en dichas en redes (.1) ?

Respuesta: Las redes de R1 se conocen vía EIGRP, mientras que las redes de R3 se conocen vía OSPF
		   Si, hay conectividad

R2#
R2#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        1.1.1.0/30 is directly connected, FastEthernet0/0
L        1.1.1.2/32 is directly connected, FastEthernet0/0
      2.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        2.2.2.0/30 is directly connected, FastEthernet1/0
L        2.2.2.1/32 is directly connected, FastEthernet1/0
      10.0.0.0/24 is subnetted, 2 subnets
D        10.1.1.0 [90/156160] via 1.1.1.1, 00:02:18, FastEthernet0/0
D        10.1.2.0 [90/156160] via 1.1.1.1, 00:02:18, FastEthernet0/0
      172.16.0.0/24 is subnetted, 2 subnets
O        172.16.1.0 [110/2] via 2.2.2.2, 00:01:35, FastEthernet1/0
O        172.16.2.0 [110/2] via 2.2.2.2, 00:01:35, FastEthernet1/0
R2#

R2#
R2#ping 10.1.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 24/29/36 ms
R2#
R2#ping 10.1.2.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.2.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 24/32/40 ms
R2#
R2#ping 172.16.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.16.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 24/32/40 ms
R2#
R2#ping 172.16.2.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.16.2.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 28/31/36 ms
R2#
_____________________________________________________________________________________

2. Hay conectividad desde R1 a las redes LAN de R3 (172.16.1.0/24 y 172.16.2.0/24) ?

Respuesta: No, no hay conectividad 

R1#ping 172.16.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.16.1.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
R1#
R1#ping 172.16.2.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.16.2.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
R1#
_____________________________________________________________________________________

3. Hay conectividad desde R3 a las redes LAN de R1 (10.1.1.0/24 y 10.1.2.0/24) ?

Respuesta: No, no hay conectividad

R3#
R3#ping 10.1.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.1.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
R3#
R3#ping 10.1.2.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.2.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
R3#

_____________________________________________________________________________________

4. Redistribuye en el proceso OSPF id-1 de R2 las rutas EIGRP con una métrica 10 y deben incluirse las subredes

R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router ospf 1
R2(config-router)#redistribute eigrp 100 metric 10 subnets
R2(config-router)#end
R2#

______________________________________________________________________________

5. Redistribuye en el proceso EIGRP con AS 100 de R2 las rutas del proceso OSPF id-1, debe asignarse una métrica inicial o seed metric con 1 Mb, un delay de 10 ms, un 255% de reliability, una carga o load de 100 y una MTU de 1500

R2#     conf t
R2(config)#router eigrp 100
R2(config-router)#redistribute ospf 1 metric 1024 10 255 100 1500
R2(config-router)#
R2(config-router)#end
R2#
_____________________________________________________________________________________

6. Hay conectividad desde R1 a las redes LAN de R3 (172.16.1.0/24 y 172.16.2.0/24) ? A través de qué rutas se aprenden ?

Respuesta: Si, hay conectividad
		   Se aprenden como EIGRP External routes con una distancia administrativa de 170, es decir, vienen redistribuidas

R1#
R1#ping 172.16.2.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.16.2.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 56/61/72 ms
R1#
R1#
R1#show ip route | in 172.16.2
D EX     172.16.2.0 [170/2504960] via 1.1.1.2, 00:01:55, FastEthernet0/0
R1#
R1#show ip route | in 172.16.1
D EX     172.16.1.0 [170/2504960] via 1.1.1.2, 00:01:58, FastEthernet0/0
R1#
_____________________________________________________________________________________

7. Hay conectividad desde R3 a las redes LAN de R1 (10.1.1.0/24 y 10.1.2.0/24) ? A través de qué rutas se aprenden ?

Respuesta: Si, hay conectividad
		   Se aprenden como OSPF External-Type 2 con una métrica 10

R3#ping 10.1.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 52/58/64 ms
R3#
R3#ping 10.1.2.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.2.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 52/61/68 ms
R3#
R3#
R3#show ip route | in 10.1.1.0
O E2     10.1.1.0 [110/10] via 2.2.2.1, 00:07:37, FastEthernet1/0
R3#
R3#show ip route | in 10.1.2.
O E2     10.1.2.0 [110/10] via 2.2.2.1, 00:07:41, FastEthernet1/0
R3#
_____________________________________________________________________________________